Loaner/GetCreditScore/Connected Services/CreditScoreService/CreditScoreService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://service.web.credit.bank.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" name="CreditScoreService" targetNamespace="http://service.web.credit.bank.org/" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="http://138.68.85.24:8080/CreditScoreService/CreditScoreService?xsd=1" namespace="http://service.web.credit.bank.org/" />
    </xsd:schema>
  </types>
  <message name="creditScore">
    <part name="parameters" element="tns:creditScore" />
  </message>
  <message name="creditScoreResponse">
    <part name="parameters" element="tns:creditScoreResponse" />
  </message>
  <portType name="CreditScoreService">
    <operation name="creditScore">
      <input wsam:Action="http://service.web.credit.bank.org/CreditScoreService/creditScoreRequest" message="tns:creditScore" />
      <output wsam:Action="http://service.web.credit.bank.org/CreditScoreService/creditScoreResponse" message="tns:creditScoreResponse" />
    </operation>
  </portType>
  <binding name="CreditScoreServicePortBinding" type="tns:CreditScoreService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="creditScore">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
  </binding>
  <service name="CreditScoreService">
    <port name="CreditScoreServicePort" binding="tns:CreditScoreServicePortBinding">
      <soap:address location="http://138.68.85.24:8080/CreditScoreService/CreditScoreService" />
    </port>
  </service>
</definitions>